app/Services/AppContextService.php

SELECT `users`.*, `role_name`, `permissions`, `is_super_admin`, `is_admin`, `is_vendor`, `is_member`
FROM `users`
JOIN `roles_permissions` ON `roles_permissions`.`id` = `users`.`role_id`
WHERE `users`.`id` = 1
---
    protected function initAuth(): void
    {
        $userId = clrNum($this->session->get('auth_user_id'));
        $authToken = $this->session->get('auth_token');

        if (!empty($userId) && !empty($authToken)) {
            $user = $this->db->table('users')->join('roles_permissions', 'roles_permissions.id = users.role_id')
                ->select('users.*, role_name, permissions, is_super_admin, is_admin, is_vendor, is_member')
                ->where('users.id', $userId)->get()->getRow();

SELECT *
FROM `currencies`
ORDER BY `status` DESC, `id`
---
    protected function initCurrencies(): void
    {
        $currencyList = $this->db->table('currencies')->orderBy('status DESC, id')->get()->getResult();