app/Models/AuthModel.php

UPDATE `users` SET `last_seen` = '2026-02-18 09:06:30'
WHERE `id` = '1'
---
    public function updateLastSeen()
    {
        if (authCheck()) {
            $this->builder->where('id', user()->id)->update(['last_seen' => date('Y-m-d H:i:s')]);