app/Models/BiddingModel.php

SELECT COUNT(*) AS `numrows`
FROM `quote_requests`
JOIN `products` ON `quote_requests`.`product_id` = `products`.`id`
WHERE `products`.`status` = 1
AND `products`.`is_draft` = 0
AND `products`.`is_deleted` = 0
AND ((products.product_type = 'physical' AND `products`.`stock` > 0) OR `products`.`product_type` = 'digital')
AND `quote_requests`.`seller_id` = 3
AND `quote_requests`.`is_seller_deleted` = 0
AND `quote_requests`.`status` = 'new_quote_request'
---
    public function getNewQuoteRequestsCount($userId)
    {
        return $this->builder->join('products', 'quote_requests.product_id = products.id')->where('products.status', 1)->where('products.is_draft', 0)
            ->where('products.is_deleted', 0)->where("((products.product_type = 'physical' AND products.stock > 0) OR products.product_type = 'digital')")
            ->where('quote_requests.seller_id', clrNum($userId))->where('quote_requests.is_seller_deleted', 0)->where('quote_requests.status', 'new_quote_request')->countAllResults();