app/Models/CartModel.php

SELECT `c`.*, `ci`.*, `c`.`id` AS `cart_id`, `p`.`shipping_dimensions`, `u`.`couriers`, `p`.`district_id` as `origin`, `ci`.`id` AS `item_id`, (SELECT CONCAT(username, '|||', slug) FROM users WHERE users.id = ci.seller_id) AS seller_info
FROM `carts` `c`
LEFT JOIN `cart_items` `ci` ON `c`.`id` = `ci`.`cart_id`
LEFT JOIN `users` `u` ON `ci`.`seller_id` = `u`.`id`
LEFT JOIN `products` `p` ON `p`.`id` = `ci`.`product_id`
WHERE `c`.`user_id` = '1'
---
    public function fetchRawCartData()
    {
        $userId = 0;
        $cartSessionId = '';

        if (authCheck()) {
            $userId = user()->id;
        } else {
            $cartSessionId = helperGetSession('cartSessionId');
        }

        if (!$userId && !$cartSessionId) {
            return null;
        }

        $builder = $this->db->table("carts c")
            ->select("c.*, ci.*, c.id AS cart_id,p.shipping_dimensions,u.couriers,p.district_id as origin, ci.id AS item_id, (SELECT CONCAT(username, '|||', slug) FROM users WHERE users.id = ci.seller_id) AS seller_info")
            ->join("cart_items ci", "c.id = ci.cart_id", "left")
            ->join("users u", "ci.seller_id = u.id", "left")
            ->join("products p", "p.id = ci.product_id", "left");

        if ($userId) {
            $builder->where('c.user_id', $userId);
        } else {
            $builder->where('c.session_id', $cartSessionId);
        }

        $results = $builder->get()->getResultObject();

UPDATE `carts` SET `exchange_rate` = '16483.05'
WHERE `id` = 30
---
        $shippingData = safeJsonDecode($results[0]->shipping_data ?? '');

        //set exchange rate and location
        $this->builderCarts->where('id', $cartId)->update([
            'exchange_rate' => $currency->exchange_rate
        ]);

UPDATE `cart_items` SET `item_hash` = 'f6627aca00f5a384c8f4009ac431b503', `product_id` = '31', `seller_id` = '1', `product_type` = 'digital', `listing_type` = 'license_key', `product_title` = 'Car Race Pro License Keys', `product_sku` = 'C1R2P3L4K5Y6', `quantity` = '1', `unit_price` = '313177.95', `unit_price_base` = '19', `total_price` = '313177.95', `product_vat` = 0, `product_vat_rate` = 0, `product_image_id` = '76', `product_image_data` = '{\"path\":\"202508/img_w480_68b44a894eb0d0-11724417.webp\",\"storage\":\"local\"}', `purchase_type` = 'product', `quote_request_id` = '0', `variant_hash` = NULL, `extra_options` = NULL, `extra_options_hash` = '{}', `product_options_snapshot` = NULL, `product_options_summary` = '', `is_stock_available` = 1
WHERE `id` = '38'
---
        if (!empty($existingItem)) {
            if ($product->product_type != 'digital' && $product->listing_type != 'license_key') {
                $newQuantity = $existingItem->quantity + $quantity;
                $this->updateItemQuantity($existingItem->id, $newQuantity);