app/Models/CartModel.php

    public function fetchRawCartData()
    {
        $userId = 0;
        $cartSessionId = '';

        if (authCheck()) {
            $userId = user()->id;
        } else {
            $cartSessionId = helperGetSession('cartSessionId');
        }

        if (!$userId && !$cartSessionId) {
            return null;
        }

        $builder = $this->db->table("carts c")
            ->select("c.*, ci.*, c.id AS cart_id,p.shipping_dimensions,u.couriers,p.district_id as origin, ci.id AS item_id, (SELECT CONCAT(username, '|||', slug) FROM users WHERE users.id = ci.seller_id) AS seller_info")
            ->join("cart_items ci", "c.id = ci.cart_id", "left")
            ->join("users u", "ci.seller_id = u.id", "left")
            ->join("products p", "p.id = ci.product_id", "left");

        if ($userId) {
            $builder->where('c.user_id', $userId);
        } else {
            $builder->where('c.session_id', $cartSessionId);
        }

        $results = $builder->get()->getResultObject();
---
SELECT `c`.*, `ci`.*, `c`.`id` AS `cart_id`, `p`.`shipping_dimensions`, `u`.`couriers`, `p`.`district_id` as `origin`, `ci`.`id` AS `item_id`, (SELECT CONCAT(username, '|||', slug) FROM users WHERE users.id = ci.seller_id) AS seller_info
FROM `carts` `c`
LEFT JOIN `cart_items` `ci` ON `c`.`id` = `ci`.`cart_id`
LEFT JOIN `users` `u` ON `ci`.`seller_id` = `u`.`id`
LEFT JOIN `products` `p` ON `p`.`id` = `ci`.`product_id`
WHERE `c`.`user_id` = '1'


        //check base currency
        if (empty($currencyCodeBase) || $currencyCodeBase != $this->defaultCurrency->code) {
            $this->builderCarts->where('id', clrNum($cartId))->delete();
---
DELETE FROM `carts`
WHERE `id` = 22

        $shippingData = safeJsonDecode($results[0]->shipping_data ?? '');

        //set exchange rate and location
        $this->builderCarts->where('id', $cartId)->update([
            'exchange_rate' => $currency->exchange_rate
        ]);
---
UPDATE `carts` SET `exchange_rate` = '16483.05'
WHERE `id` = 29