app/Models/ChatModel.php

SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `chat_id`
FROM `chat_messages`
WHERE `receiver_id` = 1
AND `is_read` = 0
AND `deleted_user_id` = 0
) CI_count_all_results
---
    public function getUnreadChatsCount($userId)
    {
        return $this->builderMessages->select('chat_id')
            ->where('receiver_id', clrNum($userId))
            ->where('is_read', 0)
            ->where('deleted_user_id', 0)
            ->distinct()->countAllResults();