app/Models/CheckoutModel.php

SELECT `id`
FROM `checkouts`
WHERE `status` = 'expired'
---
    public function deleteExpiredCheckouts()
    {
        $expiredCheckoutIds = $this->builderCheckouts->where('status', self::STATUS_EXPIRED)->select('id')->get()->getResultArray();