app/Models/FieldModel.php

    public function getFieldOptions($customField, $langId)
    {
        if (empty($customField)) {
            return [];
        }

        $builder = $this->builderFieldOptions;
        if ($langId == $this->defaultLangId) {
            $builder->select('custom_fields_options.*, cfol.name AS name');
            $builder->join('custom_field_option_lang cfol', 'cfol.option_id = custom_fields_options.id AND cfol.lang_id = ' . $this->db->escape($langId), 'left');
        } else {
            $builder->select('custom_fields_options.*, COALESCE(cfol_selected.name, cfol_default.name) AS name');
            $builder->join('custom_field_option_lang cfol_selected', 'cfol_selected.option_id = custom_fields_options.id AND cfol_selected.lang_id = ' . $this->db->escape($langId), 'left');
            $builder->join('custom_field_option_lang cfol_default', 'cfol_default.option_id = custom_fields_options.id AND cfol_default.lang_id = ' . $this->db->escape($this->defaultLangId), 'left');
        }

        $builder->where('custom_fields_options.field_id', clrNum($customField->id));

        if ($customField->sort_options == 'date') {
            $builder->orderBy('custom_fields_options.id', 'ASC');
        } elseif ($customField->sort_options == 'date_desc') {
            $builder->orderBy('custom_fields_options.id', 'DESC');
        } elseif ($customField->sort_options == 'alphabetically') {
            $builder->orderBy('name', 'ASC');
        }

        return $builder->get()->getResult();
---
SELECT `custom_fields_options`.*, `cfol`.`name` AS `name`
FROM `custom_fields_options`
LEFT JOIN `custom_field_option_lang` `cfol` ON `cfol`.`option_id` = `custom_fields_options`.`id` AND `cfol`.`lang_id` = '1'
WHERE `custom_fields_options`.`field_id` = 2
ORDER BY `name` ASC

    public function getSelectedCustomFieldValuesForProduct($fieldId, $productId, $langId)
    {
        $fieldId = clrNum($fieldId);
        $productId = clrNum($productId);
        $langId = clrNum($langId);

        $defaultLangId = $this->defaultLangId ?? 1;

        $builder = $this->db->table('custom_fields_product AS cfp');
        $builder->join('custom_fields_options AS cfo', 'cfo.id = cfp.selected_option_id', 'left');

        if ($langId == $defaultLangId) {
            $builder->select('cfp.*, cfol.name AS selected_option_name');
            $builder->join('custom_field_option_lang AS cfol', 'cfol.option_id = cfo.id AND cfol.lang_id = ' . $this->db->escape($langId), 'left');
        } else {
            $builder->select('cfp.*, COALESCE(cfol_selected.name, cfol_default.name) AS selected_option_name');
            $builder->join('custom_field_option_lang AS cfol_selected', 'cfol_selected.option_id = cfo.id AND cfol_selected.lang_id = ' . $this->db->escape($langId), 'left');
            $builder->join('custom_field_option_lang AS cfol_default', 'cfol_default.option_id = cfo.id AND cfol_default.lang_id = ' . $this->db->escape($defaultLangId), 'left');
        }

        $builder->where('cfp.field_id', $fieldId)->where('cfp.product_id', $productId);
        return $builder->get()->getResult();
---
SELECT `cfp`.*, `cfol`.`name` AS `selected_option_name`
FROM `custom_fields_product` AS `cfp`
LEFT JOIN `custom_fields_options` AS `cfo` ON `cfo`.`id` = `cfp`.`selected_option_id`
LEFT JOIN `custom_field_option_lang` AS `cfol` ON `cfol`.`option_id` = `cfo`.`id` AND `cfol`.`lang_id` = 1
WHERE `cfp`.`field_id` = 2
AND `cfp`.`product_id` = 51