app/Models/FileModel.php

    public function getProductImages($productId, $getOptionImages = false)
    {
        $this->builderImages->where('product_id', clrNum($productId));
        if ($getOptionImages == false) {
            $this->builderImages->where('is_option_image', 0);
        }
        return $this->builderImages->orderBy('images.is_main DESC, images.id')->get(300)->getResult();
---
SELECT *
FROM `images`
WHERE `product_id` = 38
AND `is_option_image` = 0
ORDER BY `images`.`is_main` DESC, `images`.`id`
 LIMIT 300

    public function getImage($imageId)
    {
        return $this->builderImages->where('images.id', clrNum($imageId))->get()->getRow();
---
SELECT *
FROM `images`
WHERE `images`.`id` = 88

    public function getProductMainImage($productId)
    {
        return $this->builderImages->where('product_id', clrNum($productId))->orderBy('images.is_main DESC')->get()->getRow();
---
SELECT *
FROM `images`
WHERE `product_id` = 38
ORDER BY `images`.`is_main` DESC

    public function getUserFileManagerImages($userId)
    {
        return $this->builderFileManager->where('user_id', clrNum($userId))->orderBy('id DESC')->get()->getResult();
---
SELECT *
FROM `images_file_manager`
WHERE `user_id` = 3
ORDER BY `id` DESC

    public function getProductVideo($productId)
    {
        return $this->builderMedia->where('product_id', clrNum($productId))->where('media_type', 'video')->get()->getRow();
---
SELECT *
FROM `media`
WHERE `product_id` = 38
AND `media_type` = 'video'

    public function getProductAudio($productId)
    {
        return $this->builderMedia->where('product_id', clrNum($productId))->where('media_type', 'audio')->get()->getRow();
---
SELECT *
FROM `media`
WHERE `product_id` = 38
AND `media_type` = 'audio'