app/Models/OrderModel.php

    public function getOrdersCount($userId)
    {
        return $this->builder->where('buyer_id', clrNum($userId))->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `buyer_id` = 1

    public function getOrdersPaginated($userId, $perPage, $offset)
    {
        return $this->builder->where('buyer_id', clrNum($userId))->orderBy('id DESC')->limit($perPage, $offset)->get()->getResult();
---
SELECT *
FROM `orders`
WHERE `buyer_id` = 1
ORDER BY `id` DESC
 LIMIT 15

    public function getOrderItems($orderId)
    {
        return $this->builderOrderItems->where('order_id', clrNum($orderId))->get()->getResult();
---
SELECT *
FROM `order_items`
WHERE `order_id` = 9

    public function getOrder($id)
    {
        return $this->builder->where('id', clrNum($id))->get()->getRow();
---
SELECT *
FROM `orders`
WHERE `id` = 10

    public function getOrderByOrderNumber($orderNumber)
    {
        return $this->builder->where('order_number', clrNum($orderNumber))->get()->getRow();
---
SELECT *
FROM `orders`
WHERE `order_number` = 10009

    public function checkUserBoughtProduct($userId, $productId)
    {
        if (!empty($this->builderOrderItems->where('buyer_id', clrNum($userId))->where('product_id', clrNum($productId))->get()->getRow())) {
---
SELECT *
FROM `order_items`
WHERE `buyer_id` = 1
AND `product_id` = 51

    public function getSellerActiveRefundRequestCount($userId)
    {
        return $this->builderRefundRequests->where('seller_id', clrNum($userId))->where('status = 0')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `refund_requests`
WHERE `seller_id` = 3
AND `status` = 0