app/Models/OrderAdminModel.php

    public function getOrderItems($orderId)
    {
        return $this->builderOrderItems->where('order_id', clrNum($orderId))->get()->getResult();
---
SELECT *
FROM `order_items`
WHERE `order_id` = 10

    public function getTransactionByOrderId($orderId)
    {
        return $this->builderTransactions->where('order_id', clrNum($orderId))->get()->getRow();
---
SELECT *
FROM `transactions`
WHERE `order_id` = 9