app/Models/ProductAdminModel.php

SELECT *
FROM `products`
WHERE `products`.`id` = 51
---
    public function getProduct($id)
    {
        return $this->builder->where('products.id', clrNum($id))->get()->getRow();