app/Models/ProductModel.php

SELECT *
FROM `products`
WHERE `is_promoted` = 1
---
    public function checkPromotedProducts()
    {
        $products = $this->builder->where('is_promoted', 1)->get()->getResult();

SELECT `products`.*, `pd`.`title`
FROM `products`
LEFT JOIN `product_details` AS `pd` ON `pd`.`product_id` = `products`.`id` AND `pd`.`lang_id` = '1'
WHERE `products`.`id` = 51
---
    public function getProduct($id)
    {
        return $this->builder->select("products.*, pd.title")
            ->join('product_details AS pd', 'pd.product_id = products.id AND pd.lang_id = ' . $this->db->escape($this->defaultLang->id), 'left')
            ->where('products.id', clrNum($id))->get()->getRow();

SELECT *
FROM `product_details`
WHERE `product_id` = 38
AND `lang_id` = 1
---
    public function getProductDetails($id, $langId, $getMainOnNull = true)
    {
        $row = $this->builderProductDetails->where('product_id', clrNum($id))->where('lang_id', clrNum($langId))->get()->getRow();

SELECT *
FROM `wishlist`
WHERE `user_id` = '1'
AND `product_id` = 38
---
    public function isProductInWishlist($productId)
    {
        if (authCheck()) {
            if (!empty($this->builderWishlist->where('user_id', user()->id)->where('product_id', clrNum($productId))->get()->getRow())) {

SELECT COUNT(*) AS `numrows`
FROM `wishlist`
WHERE `product_id` = 38
---
    public function getProductWishlistCount($productId)
    {
        return $this->builderWishlist->where('product_id', clrNum($productId))->countAllResults();

SELECT *
FROM `product_license_keys`
WHERE `product_id` = 51
---
    public function getProductLicenseKeys($productId)
    {
        return $this->builderProductLicenseKeys->where('product_id', clrNum($productId))->get()->getResult();