app/Models/ProfileModel.php

    public function getShippingAddresses($userId)
    {
        return $this->builderShippingAddresses->where('user_id', clrNum($userId))->get()->getResult();
---
SELECT *
FROM `shipping_addresses`
WHERE `user_id` = 3

    public function getFirstShippingAddress($userId, $addressType)
    {
        return $this->builderShippingAddresses->where('user_id', clrNum($userId))->where('address_type', cleanStr($addressType))->get(1)->getRow();
---
SELECT *
FROM `shipping_addresses`
WHERE `user_id` = 1
AND `address_type` = 'shipping'
 LIMIT 1