app/Models/TagModel.php

    public function getProductTagsString($productId, $langId)
    {
        $tagsStr = '';
        $tags = $this->builder->join('product_tags', 'tags.id = product_tags.tag_id')
            ->where('product_tags.product_id', clrNum($productId))->where('tags.lang_id', clrNum($langId))->get()->getResultArray();
---
SELECT *
FROM `tags`
JOIN `product_tags` ON `tags`.`id` = `product_tags`.`tag_id`
WHERE `product_tags`.`product_id` = 0
AND `tags`.`lang_id` = 1